#include "other.h"

ITEM item_data[ITEMNUM];
void init_item() {
	item_data[0x40] = {
		"ブロードソード",	//名前
		EQUIP_WEP,			//装備部位
		8,					//武器性能
		1,					//重さ
		EQUIP_NOGURAD,		//耐性
		{},					//防御力
		{0,0x09,-1,-1,-1}		//技
	};
	item_data[0x41] = {
		"ロングソード",	//名前
		EQUIP_WEP,			//装備部位
		11,					//武器性能
		2,					//重さ
		EQUIP_NOGURAD,		//耐性
		{},					//防御力
		{ 0,0x09,0x0A,0x0B,-1 }		//技
	};
	item_data[0x42] = {
		"脇差",	//名前
		EQUIP_WEP,			//装備部位
		9,					//武器性能
		1,					//重さ
		EQUIP_NOGURAD,		//耐性
		{},					//防御力
		{ 0,0x09,0x0A,-1,-1 }		//技
	};
	item_data[0x4f] = {
		"七支刀",	//名前
		EQUIP_WEP,			//装備部位
		77,					//武器性能
		1,					//重さ
		EQUIP_NOGURAD,		//耐性
		{},					//防御力
		{ 0,0x0C,0x0A,-1,-1 }		//技
	};

	item_data[0x50] = {
		"ハンドアックス",
		EQUIP_HANDS,
		10,
		4,					//重さ
		EQUIP_NOGURAD,
		{},
		{ 4,0x0B,-1,-1,-1 }
	};
	item_data[0x60] = {
		"竹槍",
		EQUIP_WEP,
		8,
		2,
		EQUIP_NOGURAD,
		{},
		{2,-1,-1,-1,-1 }
	};
	item_data[0x70] = {
		"長弓",				//名前
		EQUIP_HANDS,		//装備部位
		9,					//武器性能
		1,					//重さ
		EQUIP_NOGURAD,		//耐性
		{},					//防御力
		{ 3,-1,-1,-1,-1 }		//技
	};
	item_data[0x80] = {
		"皮鎧",	//名前
		EQUIP_BODY,			//装備部位
		6,					//武器性能
		3,					//重さ
		EQUIP_NOGURAD,		//耐性
		{6,12,6,6,12,12,6,6},					//防御力
		{ -1,-1,-1,-1,-1 }		//技
	};
	item_data[0x81] = {
		"ボーンプレスト",	//名前
		EQUIP_BODY,			//装備部位
		13,					//武器性能
		2,					//重さ
		EQUIP_NOGURAD,		//耐性
		{ 13,4,13,13,4,13,13,13},					//防御力
		{ -1,-1,-1,-1,-1 }		//技
	};
	item_data[0x8f] = {
		"竜麟の鎧",	//名前
		EQUIP_BODY,			//装備部位
		35,					//武器性能
		2,					//重さ
		EQUIP_NOGURAD,		//耐性
		{ 35,35,35,35,45,45,25,25 },					//防御力
		{ -1,-1,-1,-1,-1 }		//技
	};
	item_data[0x90] = {
		"帽子",	//名前
		EQUIP_HEAD,			//装備部位
		3,					//武器性能
		0,					//重さ
		EQUIP_NOGURAD,		//耐性
		{3,3,3,3,3,3,3,3},					//防御力
		{ -1,-1,-1,-1,-1 }		//技
	};
	item_data[0xA0] = {
		"皮手袋",	//名前
		EQUIP_ARMS,			//装備部位
		2,					//武器性能
		0,					//重さ
		EQUIP_NOGURAD,		//耐性
		{2,2,2,2,2,10,2,2},					//防御力
		{ -1,-1,-1,-1,-1 }		//技
	};
	item_data[0xB0] = {
		"フロンティアのブーツ",	//名前
		EQUIP_REGS,			//装備部位
		4,					//武器性能
		1,					//重さ
		EQUIP_NOGURAD,		//耐性
		{4,4,4,4,4,4,4,4},					//防御力
		{ -1,-1,-1,-1,-1 }		//技
	};
	item_data[0xC0] = {
		"フェイススーツ",	//名前
		EQUIP_FULL,			//装備部位
		25,					//武器性能
		10,					//重さ
		EQUIP_NOGURAD,		//耐性
		{25,42,25,25,18,18,9,18},					//防御力
		{ -1,-1,-1,-1,-1 }		//技
	};
	//空欄
	item_data[0xFF] = {
		"",	//名前
		EQUIP_SOME,			//装備部位
		0,					//武器性能
		0,					//重さ
		EQUIP_NOGURAD,		//耐性
		{},					//防御力
		{ -1,-1,-1,-1,-1 }		//技
	};
}